{
	"_id": "circulate_trial_001",
  	"title": "Circulate Colorectal Cancer Trial",
	"full_text": "Key inclusion criteria: Eligible subjects shall meet all of the following; patients who have recurrence after the initial registration and are eligible for radical surgical resection again can be re-registered. (1) Histopathologically diagnosed with adenocarcinoma. (2) The primary location of the tumor is the colon or rectum. (3) Cohort A: The clinical stage is equivalent to stage II, III colon cancer (including rectosigmoid) for which R0 resection has been scheduled. Cohort B: The clinical stage is equivalent to stage II, III rectal cancer (excluding rectosigmoid) for which R0 resection has been scheduled; patients with lateral lymph node metastasis can be included. Cohort C: The clinical stage is equivalent to stage IV or relapse (M1) colorectal cancer for which R0 resection has been scheduled. Cohort D: pT1 colorectal cancer after local resection, requiring additional colorectal resection with lymph node dissection due to non-curative factors (T1b SM >1000 μm, positive vascular invasion, poorly differentiated adenocarcinoma/signet-ring/mucinous carcinoma, or tumor budding grade 2/3). Cohort E: Pathological stage IIB, IIC, III colorectal cancer for which R0 resection was performed within 48 weeks prior to enrollment; rectal cancer (excluding rectosigmoid) with lateral lymph node metastasis may be included; standard peri-operative chemotherapy is scheduled, ongoing, or completed. (4) Age ≥20 years at informed consent. (5) ECOG PS 0 or 1. (6) Written informed consent provided. Key exclusion criteria: (1) Two or more synchronous colorectal cancers, except patients with stage II, III, IV, or recurrent (M1) disease where concurrent Tis or T1a lesions cured by local treatment may be included; pT1 post-local resection patients may enroll if other T1a lesions are also cured by local treatment. (2) Active double cancer. (3) For Cohort A or D: history of surgery, chemotherapy, immunotherapy, or radiotherapy within 6 months before enrollment. (4) Pregnant or breastfeeding women. (5) Serious complications. (6) Positive HBs antigen or positive HCV antibody (HCV Ab positive but RNA negative is eligible). (7) HIV antibody positive (testing not required). (8) Active COVID-19 infection; patients with negative testing and no symptoms may be included unless judged otherwise by physician. (9) Determined ineligible by study doctor."
}
