[
  {
    "patient_id": "P001",
    "full_text": "Patient is a 62-year-old Caucasian male with a diagnosis of stage IIIB colorectal adenocarcinoma (pT3N2M0). Initial diagnosis was made on 03/15/2023 following colonoscopy with biopsy. Patient underwent right hemicolectomy on 04/02/2023 with R0 resection. Pathology confirmed moderately differentiated adenocarcinoma with lymphovascular invasion present. 4 of 18 lymph nodes positive for metastatic disease.\n\nCurrent medications: Ondansetron 8mg PRN, Oxycodone 5mg PRN, Pantoprazole 40mg daily.\n\nLab values (05/10/2023): CEA 3.2 ng/mL, WBC 6.8, Hgb 12.4, Platelets 245, Creatinine 0.9, ALT 28, AST 32.\n\nECOG Performance Status: 1\n\nPatient is HBsAg negative, HCV antibody negative. No active infections. No history of other malignancies. Patient has well-controlled hypertension and type 2 diabetes. No known drug allergies.\n\nSignatera ctDNA test (05/15/2023): Positive (2.1 MTM/mL)\n\nPlan: Adjuvant FOLFOX chemotherapy x 6 months."
  },
  {
    "patient_id": "P002",
    "full_text": "65-year-old Asian female presenting with stage II colon cancer (pT3N0M0). Diagnosed 02/20/2023 after presenting with rectal bleeding. Underwent laparoscopic sigmoid colectomy on 03/10/2023 with clear margins (R0). Pathology: moderately differentiated adenocarcinoma, no lymphovascular invasion. 0 of 22 lymph nodes involved.\n\nMedications: Lisinopril 10mg daily, Metformin 500mg BID, Aspirin 81mg daily.\n\nLabs (04/01/2023): CEA 1.8 ng/mL, WBC 5.4, Hgb 11.2, Platelets 198, Creatinine 0.8, ALT 22, AST 25, HbA1c 6.8%.\n\nECOG PS: 0\n\nHBsAg negative, HCV Ab negative. Medical history includes hypertension, type 2 diabetes, hypothyroidism. No prior malignancies. NKDA.\n\nSignatera (04/05/2023): Negative\n\nConsideration for observation vs adjuvant chemotherapy given intermediate risk features."
  },
  {
    "patient_id": "P003",
    "full_text": "58-year-old African American male with stage IIIC rectal adenocarcinoma (cT3N2bM0). MRI staging showed tumor 8cm from anal verge with mesorectal fascia involvement. Underwent neoadjuvant chemoradiation with capecitabine completed 01/15/2024.\n\nPost-treatment restaging shows good response. Scheduled for low anterior resection with TME on 03/01/2024.\n\nCurrent meds: Capecitabine (completed), Ondansetron PRN, Loperamide PRN.\n\nLabs (02/15/2024): CEA 4.5 ng/mL, WBC 4.2, Hgb 10.8, Platelets 156, Creatinine 1.1, Bilirubin 0.8.\n\nECOG PS: 1\n\nHBsAg negative, anti-HCV negative, HIV negative. History of GERD, obesity (BMI 32). No other cancers. Allergic to sulfa drugs.\n\nAwait surgical resection for definitive staging."
  },
  {
    "patient_id": "P004",
    "full_text": "71-year-old Caucasian female with metastatic colorectal cancer (stage IVA, pT4aN1M1a). Primary tumor in ascending colon with synchronous liver metastases (2 lesions, segments 6 and 7, both <3cm). Diagnosed 11/2023.\n\nUnderwent right hemicolectomy 12/05/2023. Liver metastases deemed resectable. Planning for hepatic metastasectomy after systemic therapy.\n\nCurrently receiving FOLFOX + bevacizumab, cycle 4 of planned 8.\n\nMeds: FOLFOX regimen, Bevacizumab, Dexamethasone, Ondansetron, Filgrastim PRN.\n\nLabs (01/20/2024): CEA 12.4 ng/mL (down from 45), WBC 3.8, ANC 1.8, Hgb 10.2, Platelets 142, Creatinine 0.9, ALT 45, AST 38.\n\nECOG PS: 1\n\nHBsAg neg, HCV Ab neg. History of osteoporosis, GERD. No prior cancers. NKDA.\n\nR0 resection of primary achieved. Awaiting restaging scans for liver surgery planning."
  },
  {
    "patient_id": "P005",
    "full_text": "45-year-old Hispanic male with early-onset colorectal cancer, stage IIB (pT4aN0M0). Found on screening colonoscopy due to family history (father with CRC at age 52). Lynch syndrome testing negative.\n\nUnderwent extended right hemicolectomy 05/20/2023. Pathology: poorly differentiated adenocarcinoma with serosal involvement, negative margins, 0/24 lymph nodes positive. High-risk features present.\n\nMeds: Omeprazole 20mg daily.\n\nLabs (06/15/2023): CEA 2.1 ng/mL, WBC 7.2, Hgb 13.8, Platelets 267, Creatinine 1.0, LFTs normal.\n\nECOG PS: 0\n\nNo hepatitis, HIV negative. No significant medical history. No allergies.\n\nSignatera (06/20/2023): Positive (0.8 MTM/mL)\n\nRecommended adjuvant CAPOX for 6 months given high-risk features and positive ctDNA."
  },
  {
    "patient_id": "P006",
    "full_text": "78-year-old Caucasian male with recurrent colorectal cancer. Originally diagnosed with stage III sigmoid colon cancer in 2020, treated with surgery and adjuvant FOLFOX. Now presents with rising CEA and CT showing pelvic recurrence.\n\nBiopsy confirms recurrent adenocarcinoma. PET shows isolated pelvic mass, no distant metastases. Surgical evaluation ongoing for potential pelvic exenteration.\n\nMeds: Metoprolol 50mg daily, Atorvastatin 40mg daily, Amlodipine 5mg daily.\n\nLabs (02/01/2024): CEA 28.5 ng/mL, WBC 6.1, Hgb 11.5, Platelets 203, Creatinine 1.3, GFR 52.\n\nECOG PS: 1\n\nHBsAg neg, HCV neg. History: CAD (stents 2018), CKD stage 3a, hyperlipidemia, HTN. No other cancers.\n\nCardiology clearance obtained. Discussing surgical vs systemic options."
  },
  {
    "patient_id": "P007",
    "full_text": "52-year-old Asian female with stage III rectosigmoid adenocarcinoma (pT3N1M0). Diagnosed after workup for iron deficiency anemia. Tumor located at rectosigmoid junction.\n\nUnderwent anterior resection on 07/12/2023. R0 resection achieved. Path: mod diff adenocarcinoma, 2/16 nodes positive, no LVI.\n\nCompleted adjuvant CAPOX x 6 cycles, last dose 01/2024.\n\nMeds: Ferrous sulfate 325mg daily, Calcium/Vit D supplement.\n\nLabs (02/10/2024): CEA 1.4 ng/mL, WBC 5.8, Hgb 12.6, Platelets 215, Creatinine 0.7, LFTs normal.\n\nECOG PS: 0\n\nNo hepatitis markers. No significant PMH other than anemia. NKDA.\n\nSignatera (02/15/2024): Negative\n\nSurveillance protocol initiated."
  },
  {
    "patient_id": "P008",
    "full_text": "68-year-old Caucasian male with synchronous colorectal cancers - ascending colon (pT2N0) and sigmoid (pT3N1). Underwent subtotal colectomy 09/2023.\n\nPath: Two separate primaries, ascending well-diff, sigmoid mod-diff. 1/28 nodes positive (sigmoid basin). MSI-H detected on both tumors.\n\nGiven MSI-H status, considering immunotherapy vs standard chemotherapy.\n\nMeds: None regular.\n\nLabs (10/15/2023): CEA 3.8 ng/mL, WBC 6.5, Hgb 13.2, Platelets 234, Creatinine 0.85, LFTs normal.\n\nECOG PS: 0\n\nHBsAg neg, HCV neg. PMH: Appendectomy age 25. No other cancers in patient, but brother had colon cancer at 65.\n\nGenetic counseling completed. MLH1 methylation detected - likely sporadic MSI-H."
  },
  {
    "patient_id": "P009",
    "full_text": "55-year-old Hispanic female with T1 rectal cancer post-transanal excision. Initial local excision showed pT1b with submucosal invasion >1000 micrometers and lymphovascular invasion present.\n\nGiven high-risk features, recommended completion TME surgery. Patient initially declined, now reconsidering.\n\nMeds: Escitalopram 10mg daily, Metformin 1000mg BID.\n\nLabs (01/25/2024): CEA 1.2 ng/mL, CBC normal, CMP normal, HbA1c 7.2%.\n\nECOG PS: 0\n\nNo hepatitis. PMH: Depression, T2DM, obesity (BMI 34). No prior cancers. NKDA.\n\nPelvic MRI shows no residual disease or lymphadenopathy. However, given pathologic features, surgery recommended."
  },
  {
    "patient_id": "P010",
    "full_text": "73-year-old African American male with stage IIIB colon cancer (pT4aN2aM0). Presented with partial bowel obstruction. Emergency right hemicolectomy performed 12/01/2023.\n\nPath: Poorly diff adenocarcinoma with serosal penetration, 5/19 nodes positive, LVI present. Perineural invasion present.\n\nRecovery complicated by wound infection, now resolved. Delayed start of adjuvant therapy.\n\nMeds: Lisinopril 20mg, Metformin 850mg BID, Glipizide 5mg daily, Gabapentin 300mg TID.\n\nLabs (01/30/2024): CEA 8.2 ng/mL, WBC 7.8, Hgb 10.4, Platelets 389, Creatinine 1.2, A1c 8.1%.\n\nECOG PS: 1\n\nHBsAg neg, HCV neg. PMH: HTN, T2DM (poorly controlled), peripheral neuropathy, BPH.\n\nPlan: Modified FOLFOX (dose reduced for neuropathy) starting next week."
  },
  {
    "patient_id": "P011",
    "full_text": "48-year-old Caucasian female with Lynch syndrome (MSH2 mutation) and stage II colon cancer (pT3N0M0). Prophylactic screening detected early cancer in transverse colon.\n\nUnderwent extended right hemicolectomy 08/2023. Path: MSI-H adenocarcinoma, mod-diff, 0/22 nodes. No LVI.\n\nGiven Lynch syndrome and MSI-H status, observation recommended over adjuvant chemo.\n\nMeds: Oral contraceptive (discontinued), Vitamin D 2000 IU daily.\n\nLabs (09/20/2023): CEA 0.9 ng/mL, all other labs normal.\n\nECOG PS: 0\n\nNo hepatitis. PMH: Anxiety, history of benign ovarian cyst. Strong family history - mother with endometrial cancer, maternal aunt with CRC.\n\nDiscussing risk-reducing gynecologic surgery."
  },
  {
    "patient_id": "P012",
    "full_text": "66-year-old Asian male with stage IVB colorectal cancer. Primary sigmoid tumor with peritoneal carcinomatosis (PCI score 18) and bilateral ovarian masses (Krukenberg tumors, N/A in male - hepatic and pulmonary metastases).\n\nStarted on FOLFIRI + bevacizumab, currently cycle 2.\n\nMeds: FOLFIRI regimen, Bevacizumab, Dexamethasone, Ondansetron, Lorazepam PRN.\n\nLabs (02/05/2024): CEA 156 ng/mL, CA 19-9 89, WBC 4.2, Hgb 9.8, Platelets 134, Creatinine 0.9, Albumin 3.2, LFTs mildly elevated.\n\nECOG PS: 2\n\nHBsAg neg, HCV neg. PMH: Former smoker (30 pack-years), COPD, depression.\n\nPalliative intent treatment. Goals of care discussion completed. DNR/DNI."
  },
  {
    "patient_id": "P013",
    "full_text": "59-year-old Caucasian female with BRAF V600E mutant metastatic colon cancer. Originally stage III in 2021, progressed on adjuvant FOLFOX. Now with liver and lung metastases.\n\nPrevious lines: FOLFOX (adjuvant), FOLFIRI + bevacizumab (6 months, then PD).\n\nCurrently on encorafenib + cetuximab, started 01/2024. Early response on imaging.\n\nMeds: Encorafenib 300mg daily, Cetuximab biweekly, Omeprazole 40mg, Loperamide PRN.\n\nLabs (02/20/2024): CEA 34 ng/mL (down from 78), WBC 5.6, Hgb 11.0, Platelets 187, Mg 1.6, K 3.8.\n\nECOG PS: 1\n\nNo hepatitis. PMH: GERD, osteopenia. No other cancers.\n\nExperiencing grade 1 skin toxicity from cetuximab. Continue current regimen with supportive care."
  },
  {
    "patient_id": "P014",
    "full_text": "70-year-old Caucasian male, recently completed adjuvant FOLFOX for stage III colon cancer (pT3N1bM0). Surgery was right hemicolectomy in 06/2023. Completed 12 cycles FOLFOX in 01/2024.\n\nDeveloped grade 2 peripheral neuropathy during treatment, currently improving.\n\nMeds: Gabapentin 300mg TID, Duloxetine 30mg daily.\n\nLabs (02/25/2024): CEA 2.0 ng/mL, WBC 4.8, Hgb 12.1, Platelets 198, Creatinine 1.0, B12 normal.\n\nECOG PS: 1 (due to neuropathy)\n\nNo hepatitis. PMH: BPH, gout, mild hearing loss.\n\nSignatera (02/28/2024): Negative\n\nEntering surveillance. First follow-up CT scheduled in 3 months."
  },
  {
    "patient_id": "P015",
    "full_text": "44-year-old African American female with young-onset rectal cancer, stage IIA (pT3N0M0). No hereditary syndrome identified despite comprehensive testing.\n\nTreated with neoadjuvant chemoradiation followed by LAR with TME in 10/2023. Path: ypT2N0, near-complete response.\n\nCompleted adjuvant CAPOX x 4 cycles (shortened due to toxicity).\n\nMeds: Iron supplement, Probiotic.\n\nLabs (02/15/2024): CEA 0.8 ng/mL, Hgb 11.8, all else normal.\n\nECOG PS: 0\n\nNo hepatitis. PMH: Anxiety, IBS. No significant family history of cancer.\n\nSignatera (02/20/2024): Negative\n\nSurveillance initiated. Excellent functional outcome post-surgery."
  },
  {
    "patient_id": "P016",
    "full_text": "77-year-old Caucasian female with HER2-amplified metastatic colorectal cancer. Primary tumor in rectum, liver-limited metastases (5 lesions).\n\nRAS wild-type, HER2 IHC 3+, FISH amplified.\n\nFailed first-line FOLFOX + panitumumab. Now on trastuzumab + pertuzumab (off-label).\n\nMeds: Trastuzumab, Pertuzumab, Lisinopril, Furosemide, Metoprolol.\n\nLabs (02/10/2024): CEA 45 ng/mL, WBC 5.2, Hgb 10.5, Platelets 167, Creatinine 1.1, BNP 180.\n\nECOG PS: 1\n\nEcho (02/01/2024): LVEF 52% (down from 58% baseline). Cardiology following closely.\n\nNo hepatitis. PMH: HTN, CHF (HFpEF), atrial fibrillation on anticoagulation.\n\nMonitoring cardiac function. Will hold HER2 therapy if LVEF drops below 50%."
  },
  {
    "patient_id": "P017",
    "full_text": "63-year-old Hispanic male with locally advanced rectal cancer (cT4N2M0) invading prostate. Underwent neoadjuvant FOLFOX x 4 cycles followed by chemoradiation.\n\nRestaging shows partial response. Planning for pelvic exenteration.\n\nMeds: Tamsulosin 0.4mg, Finasteride 5mg, Omeprazole 20mg.\n\nLabs (02/28/2024): CEA 5.6 ng/mL, PSA 2.1, WBC 5.4, Hgb 11.8, Creatinine 0.95.\n\nECOG PS: 1\n\nNo hepatitis, HIV neg. PMH: BPH, erectile dysfunction, depression.\n\nMultidisciplinary discussion completed. Patient counseled on extent of surgery including permanent colostomy and possible urostomy. Considering options.\n\nSurgery tentatively scheduled for 03/2024 pending final decision."
  },
  {
    "patient_id": "P018",
    "full_text": "56-year-old Caucasian female with mucinous adenocarcinoma of appendix with pseudomyxoma peritonei (PMP). Incidentally found during cholecystectomy.\n\nUnderwent CRS/HIPEC 11/2023. Complete cytoreduction achieved (CC-0). Path showed low-grade mucinous neoplasm.\n\nRecovery uneventful. No adjuvant therapy planned for low-grade histology.\n\nMeds: None regular.\n\nLabs (01/30/2024): CEA 2.4 ng/mL, CA 19-9 18, CA-125 12, all else normal.\n\nECOG PS: 0\n\nNo hepatitis. PMH: Cholelithiasis (resolved), anxiety.\n\nSurveillance with CT and tumor markers every 6 months."
  },
  {
    "patient_id": "P019",
    "full_text": "69-year-old Asian female with obstructing sigmoid colon cancer. Presented to ED with complete bowel obstruction. Emergent surgery with Hartmann procedure performed 02/15/2024.\n\nPath pending, clinically appears stage III based on intraoperative findings (enlarged mesenteric nodes).\n\nPost-op day 7, recovering well. Planning for ostomy education and eventual reversal.\n\nMeds: IV antibiotics (transitioning to oral), Heparin prophylaxis, Pain management.\n\nLabs (02/22/2024): WBC 9.2, Hgb 10.2, Platelets 312, Creatinine 0.8, Albumin 3.0.\n\nECOG PS: 2 (post-operative)\n\nNo hepatitis. PMH: Osteoarthritis, hypothyroidism.\n\nAwaiting final pathology for staging and treatment planning. Oncology consult placed."
  },
  {
    "patient_id": "P020",
    "full_text": "82-year-old Caucasian male with stage II colon cancer (pT3N0M0) s/p right hemicolectomy 10/2023. Given age and comorbidities, adjuvant chemotherapy not recommended.\n\nPath: Well-differentiated adenocarcinoma, MSS, no high-risk features. 0/18 nodes.\n\nMeds: Amlodipine 10mg, Metoprolol 25mg BID, Aspirin 81mg, Donepezil 10mg.\n\nLabs (01/15/2024): CEA 1.8 ng/mL, Creatinine 1.4, GFR 45, all else stable.\n\nECOG PS: 2\n\nNo hepatitis. PMH: HTN, CAD, CKD stage 3b, mild dementia, falls.\n\nLives in assisted living facility. Family involved in care decisions. Surveillance adapted to patient's overall status - less intensive imaging schedule."
  },
  {
    "patient_id": "P021",
    "full_text": "47-year-old Caucasian male with stage IIIC colon cancer (pT4bN2bM0). Tumor perforated at presentation, required emergent surgery with washout. Extended right hemicolectomy with en bloc partial duodenal resection.\n\nPath: Poorly diff adenocarcinoma, 8/26 nodes positive, margin negative. MSS.\n\nHigh-risk disease. Started adjuvant FOLFOX, currently cycle 3.\n\nMeds: FOLFOX regimen, Ondansetron, Dexamethasone, Omeprazole.\n\nLabs (02/18/2024): CEA 4.2 ng/mL (down from 15), WBC 3.2, ANC 1.5, Hgb 11.0, Platelets 156.\n\nECOG PS: 1\n\nNo hepatitis. PMH: None significant. No allergies.\n\nSignatera (01/15/2024): Positive (4.5 MTM/mL)\n\nClose monitoring with repeat ctDNA after completing chemotherapy."
  },
  {
    "patient_id": "P022",
    "full_text": "61-year-old African American female with recurrent rectal cancer. Initially stage II rectal cancer in 2019, treated with neoadjuvant CRT and LAR. Now with presacral recurrence detected on surveillance CT.\n\nBiopsy confirmed recurrent adenocarcinoma. PET shows isolated presacral mass, no distant mets.\n\nPreviously received pelvic radiation - reirradiation limited. Considering systemic therapy followed by possible surgical salvage.\n\nMeds: Atorvastatin 20mg, Amlodipine 5mg.\n\nLabs (02/20/2024): CEA 18.4 ng/mL, WBC 6.8, Hgb 12.2, Creatinine 0.85.\n\nECOG PS: 0\n\nNo hepatitis. PMH: HTN, hyperlipidemia, obesity.\n\nRadiation oncology, surgical oncology, and medical oncology to discuss in tumor board."
  },
  {
    "patient_id": "P023",
    "full_text": "54-year-old Hispanic male with KRAS G12C mutant metastatic colon cancer. Liver and peritoneal metastases at diagnosis.\n\nFailed FOLFIRI + bevacizumab (12 months), then FOLFOX (4 months - progression).\n\nScreened for sotorasib trial but didn't meet criteria. Now on regorafenib.\n\nMeds: Regorafenib 120mg (dose reduced from 160mg due to hand-foot syndrome), Ondansetron, Urea cream for hands/feet.\n\nLabs (02/25/2024): CEA 89 ng/mL, WBC 4.8, Hgb 10.5, Platelets 145, AST 52, ALT 48, Bilirubin 1.2.\n\nECOG PS: 1\n\nNo hepatitis. PMH: Hyperlipidemia, fatty liver (now with tumor involvement).\n\nWatching LFTs closely. Grade 2 fatigue and hand-foot syndrome. Tolerating reduced dose."
  },
  {
    "patient_id": "P024",
    "full_text": "72-year-old Caucasian female with stage I rectal cancer (pT1N0M0). Small rectal polyp with invasive cancer found on colonoscopy. Underwent transanal excision.\n\nPath: Well-differentiated adenocarcinoma, pT1a, SM invasion <500 micrometers, no LVI, clear margins, no budding.\n\nLow-risk pT1 cancer. Observation recommended.\n\nMeds: Calcium/Vitamin D, Baby aspirin.\n\nLabs: All within normal limits. CEA 0.8 ng/mL.\n\nECOG PS: 0\n\nNo hepatitis. PMH: Osteoporosis, s/p hip replacement.\n\nSurveillance colonoscopy in 1 year. No additional therapy indicated."
  },
  {
    "patient_id": "P025",
    "full_text": "50-year-old Asian male with stage IIIA colon cancer (pT1N1M0). Small tumor with unexpected node positivity. Underwent laparoscopic right hemicolectomy 12/2023.\n\nPath: Well-diff adenocarcinoma, 1cm, 1/15 nodes positive, no LVI. MSI-H (MLH1/PMS2 loss, BRAF mutant - likely sporadic).\n\nDiscussion regarding adjuvant therapy vs observation given MSI-H status and minimal nodal involvement.\n\nMeds: Omeprazole 20mg.\n\nLabs (01/20/2024): CEA 1.0 ng/mL, all other labs normal.\n\nECOG PS: 0\n\nNo hepatitis. PMH: GERD, kidney stones.\n\nSignatera (01/25/2024): Negative\n\nAfter discussion of risks/benefits, patient elected observation with close surveillance given MSI-H status and negative ctDNA."
  }
]
