[
  {
    "patient_id": "B001",
    "full_text": "Patient is a 67-year-old Caucasian male with muscle-invasive bladder cancer (MIBC), stage III (pT3aN0M0). Presented with gross hematuria in 08/2023. TURBT on 09/01/2023 confirmed high-grade urothelial carcinoma with muscularis propria invasion.\n\nUnderwent radical cystectomy with ileal conduit on 11/15/2023 after 4 cycles neoadjuvant gemcitabine/cisplatin. Path: ypT2N0, partial response to chemotherapy.\n\nCurrent meds: Oxybutynin PRN, Vitamin B12 monthly injection, Omeprazole 20mg daily.\n\nLabs (01/10/2024): Creatinine 1.4, GFR 52, Hgb 11.2, WBC 5.8, Platelets 234.\n\nECOG PS: 1\n\nHBsAg neg, HCV neg. PMH: HTN, 40 pack-year smoking history (quit 2020). No prior malignancies.\n\nSignatera (01/15/2024): Negative\n\nSurveillance initiated. Adapting well to ileal conduit."
  },
  {
    "patient_id": "B002",
    "full_text": "73-year-old Asian female with non-muscle invasive bladder cancer (NMIBC), high-grade Ta. Recurrent disease after BCG induction and maintenance.\n\nTURBT 12/2023 showed HG Ta papillary urothelial carcinoma. CIS also present on random biopsies. BCG-unresponsive disease.\n\nDiscussing radical cystectomy vs bladder-sparing approaches (pembrolizumab, nadofaragene).\n\nMeds: None cancer-related.\n\nLabs (01/25/2024): Creatinine 0.9, GFR 68, UA with microscopic hematuria.\n\nECOG PS: 0\n\nNo hepatitis. PMH: Osteoporosis, hypothyroidism. Never smoker.\n\nReferred to medical oncology for systemic therapy options. Patient prefers bladder preservation if oncologically appropriate."
  },
  {
    "patient_id": "B003",
    "full_text": "58-year-old Caucasian male with metastatic urothelial carcinoma. Primary bladder tumor with retroperitoneal and mediastinal lymph node metastases at diagnosis.\n\nReceived first-line gemcitabine/cisplatin x 6 cycles with partial response. Maintained on avelumab maintenance since 07/2023.\n\nRecent imaging shows stable disease at 6-month scan.\n\nMeds: Avelumab q2weeks, Prednisone 5mg PRN for infusion reactions, Ondansetron PRN.\n\nLabs (02/01/2024): Creatinine 1.2, TSH 2.4, Hgb 12.0, WBC 6.2, LFTs normal.\n\nECOG PS: 1\n\nNo hepatitis. PMH: Gout, hyperlipidemia. 25 pack-year smoking history.\n\nTolerating avelumab well. No immune-related adverse events to date. Continue maintenance."
  },
  {
    "patient_id": "B004",
    "full_text": "64-year-old African American female with muscle-invasive bladder cancer, clinical stage II (cT2N0M0). Diagnosed after evaluation of recurrent UTIs and hematuria.\n\nTURBT 01/2024 showed high-grade urothelial carcinoma with detrusor muscle invasion. CT chest/abd/pelvis negative for metastatic disease.\n\nCisplatin-eligible. Planning neoadjuvant gem/cis followed by radical cystectomy.\n\nMeds: Metformin 1000mg BID, Lisinopril 10mg daily.\n\nLabs (01/28/2024): Creatinine 0.95, GFR 72, Hgb 11.8, A1c 7.0.\n\nECOG PS: 0\n\nHBsAg neg, HCV neg. PMH: Type 2 diabetes, HTN, obesity (BMI 32). Never smoker.\n\nAudiogram baseline completed. Starting chemotherapy next week."
  },
  {
    "patient_id": "B005",
    "full_text": "71-year-old Caucasian male with cisplatin-ineligible metastatic urothelial carcinoma due to CKD (GFR 38). Liver metastases present at diagnosis.\n\nStarted on carboplatin/gemcitabine, completed 6 cycles with stable disease. Now on avelumab maintenance.\n\nProgressed on maintenance at 4-month mark with new lung nodules.\n\nStarting second-line enfortumab vedotin.\n\nMeds: New - Enfortumab vedotin, continuing prior meds for comorbidities.\n\nLabs (02/15/2024): Creatinine 1.8, GFR 36, Hgb 10.2, Glucose 145, HbA1c 6.8.\n\nECOG PS: 1\n\nNo hepatitis. PMH: CKD stage 3b, diabetes, peripheral neuropathy (grade 1).\n\nMonitoring closely for EV-associated toxicities including neuropathy and skin reactions."
  },
  {
    "patient_id": "B006",
    "full_text": "55-year-old Hispanic male with upper tract urothelial carcinoma (UTUC) of left renal pelvis. High-grade, pT2N0M0 after nephroureterectomy 10/2023.\n\nPath: High-grade urothelial carcinoma, 3.5cm, invading muscularis, margins negative. No LVI. 0/8 nodes.\n\nAdjuvant nivolumab recommended given high-risk features.\n\nMeds: Nivolumab q4weeks (started 12/2023), Omeprazole.\n\nLabs (02/10/2024): Creatinine 1.3 (baseline with single kidney), TSH 3.8, LFTs normal.\n\nECOG PS: 0\n\nNo hepatitis. PMH: Kidney stones (multiple episodes). 30 pack-year smoking history.\n\nTolerating adjuvant immunotherapy well. Continue for planned 1 year course."
  },
  {
    "patient_id": "B007",
    "full_text": "79-year-old Caucasian female with localized MIBC, clinical stage II. Significant cardiac history precludes surgery.\n\nPlanned for trimodality bladder preservation: maximal TURBT followed by concurrent chemoradiation.\n\nTURBT achieved visible complete resection. Starting radiation with radiosensitizing chemotherapy.\n\nMeds: Aspirin 81mg, Metoprolol 50mg BID, Atorvastatin 40mg, Furosemide 40mg.\n\nLabs (02/20/2024): Creatinine 1.1, BNP 245, Hgb 11.5.\n\nECOG PS: 2\n\nNo hepatitis. PMH: CHF (EF 40%), CAD s/p CABG 2018, atrial fibrillation, CKD stage 3a.\n\nCardiology clearance obtained for chemoradiation. Using single-agent cisplatin at reduced dose for radiosensitization."
  },
  {
    "patient_id": "B008",
    "full_text": "62-year-old Asian male with variant histology bladder cancer - micropapillary urothelial carcinoma. Stage III (pT3bN1M0) at presentation.\n\nUnderwent radical cystectomy with extended lymphadenectomy 09/2023. 3/24 nodes positive.\n\nCompleted adjuvant gem/cis x 4 cycles. Tolerated well.\n\nMeds: Vitamin supplements, Omeprazole.\n\nLabs (01/30/2024): Creatinine 1.1, GFR 65, CBC normal.\n\nECOG PS: 1\n\nNo hepatitis. PMH: GERD, BPH. Former smoker (quit 15 years ago).\n\nSignatera (02/05/2024): Positive (1.2 MTM/mL)\n\nConcerning for microscopic residual disease. Discussing options including additional systemic therapy vs close surveillance with imaging."
  },
  {
    "patient_id": "B009",
    "full_text": "45-year-old Caucasian female with rare small cell carcinoma of bladder, limited stage. Presented with locally advanced disease (cT4N1M0) with pelvic sidewall involvement.\n\nTreating with platinum-etoposide (EP) chemotherapy per small cell protocols. Completed 4 of planned 6 cycles.\n\nImaging shows good partial response. Consolidative radiation planned.\n\nMeds: EP regimen, Ondansetron, Dexamethasone, Filgrastim.\n\nLabs (02/18/2024): WBC 2.8, ANC 1.2, Hgb 10.0, Platelets 112, Creatinine 0.9.\n\nECOG PS: 1\n\nNo hepatitis. PMH: Anxiety, migraines. 15 pack-year smoking history.\n\nTolerating therapy with expected cytopenias. Growth factor support ongoing."
  },
  {
    "patient_id": "B010",
    "full_text": "69-year-old Caucasian male status post radical cystectomy for MIBC in 2022. Now with oligometastatic recurrence - single pulmonary nodule confirmed as metastatic urothelial carcinoma on biopsy.\n\nThoracic surgery evaluation: amenable to metastasectomy.\n\nPlan: Systemic therapy followed by surgical consolidation.\n\nStarting gem/cis with plan for pulmonary metastasectomy if good response.\n\nMeds: Starting chemotherapy.\n\nLabs (02/25/2024): Creatinine 1.3, GFR 55, Hgb 13.2, LFTs normal.\n\nECOG PS: 0\n\nNo hepatitis. PMH: Former MIBC, HTN, BPH. 45 pack-year smoking history (quit at diagnosis).\n\nMultidisciplinary discussion favors aggressive approach given long disease-free interval and limited metastatic burden."
  },
  {
    "patient_id": "B011",
    "full_text": "76-year-old Hispanic female with recurrent NMIBC (HG T1) refractory to BCG. Cystectomy recommended but patient refuses.\n\nEnrolled in clinical trial for intravesical gene therapy (nadofaragene firadenovec).\n\nCompleted induction course. 3-month cystoscopy shows complete response.\n\nMeds: None related to cancer.\n\nLabs (02/28/2024): Creatinine 1.0, UA negative.\n\nECOG PS: 1\n\nNo hepatitis. PMH: Atrial fibrillation on anticoagulation, COPD, osteoarthritis.\n\nContinuing with maintenance intravesical therapy per protocol. Close cystoscopic surveillance ongoing."
  },
  {
    "patient_id": "B012",
    "full_text": "52-year-old African American male with muscle-invasive bladder cancer and synchronous prostate cancer. Bladder: cT2N0M0 high-grade UC. Prostate: Gleason 3+4, intermediate risk.\n\nMultidisciplinary discussion regarding optimal management. Plan for radical cystoprostatectomy after neoadjuvant chemotherapy for bladder cancer.\n\nCompleted neoadjuvant gem/cis. Restaging shows stable disease.\n\nMeds: Tamsulosin 0.4mg, completed chemotherapy.\n\nLabs (02/20/2024): Creatinine 1.0, PSA 8.2, Hgb 12.5.\n\nECOG PS: 0\n\nNo hepatitis. PMH: BPH, hyperlipidemia. Former smoker.\n\nScheduled for radical cystoprostatectomy with extended lymphadenectomy next month."
  },
  {
    "patient_id": "B013",
    "full_text": "68-year-old Caucasian female with pure squamous cell carcinoma of bladder, rare histology. Locally advanced (cT3bN2M0) at presentation.\n\nReceived neoadjuvant platinum-based chemotherapy with partial response.\n\nUnderwent anterior pelvic exenteration 01/2024. Path: ypT3aN1, 2/18 nodes positive.\n\nRecovering from surgery. Discussing role of adjuvant therapy.\n\nMeds: Pain management, stool softeners, DVT prophylaxis.\n\nLabs (02/15/2024): Creatinine 1.2, Hgb 9.8, Albumin 3.0.\n\nECOG PS: 2 (post-operative)\n\nNo hepatitis. PMH: Chronic schistosomiasis (acquired during travel), recurrent UTIs.\n\nSCC of bladder associated with chronic irritation. Wound healing well. Oncology follow-up scheduled."
  },
  {
    "patient_id": "B014",
    "full_text": "60-year-old Asian male with FGFR3-altered metastatic urothelial carcinoma. Progressed on first-line gem/cis and second-line pembrolizumab.\n\nFGFR3 fusion detected on comprehensive genomic profiling.\n\nStarted erdafitinib 8mg daily. Tolerating with expected hyperphosphatemia.\n\nMeds: Erdafitinib 8mg, Sevelamer for phosphorus control, Artificial tears for dry eyes.\n\nLabs (02/22/2024): Creatinine 1.3, Phosphorus 5.8 (on binders), Hgb 10.8.\n\nECOG PS: 1\n\nNo hepatitis. PMH: Hyperlipidemia. Never smoker.\n\nCT at 8 weeks shows partial response. Managing toxicities. Continue erdafitinib with close monitoring."
  },
  {
    "patient_id": "B015",
    "full_text": "74-year-old Caucasian male with widely metastatic urothelial carcinoma (liver, bone, lung). Poor performance status at presentation.\n\nCisplatin-ineligible due to PS and renal function. Started on atezolizumab single agent (PD-L1 high).\n\nDisease progression after 3 months. Transitioned to best supportive care per patient wishes.\n\nMeds: Comfort-focused - pain management, antiemetics, anxiolytics.\n\nLabs (02/28/2024): Creatinine 2.1, Hgb 8.5, Albumin 2.4, LFTs elevated.\n\nECOG PS: 3\n\nNo hepatitis. PMH: COPD, CHF, 60 pack-year smoking history.\n\nGoals of care: comfort-focused. Hospice referral completed. Family meeting held."
  },
  {
    "patient_id": "B016",
    "full_text": "57-year-old Caucasian female with MIBC, status post neoadjuvant chemotherapy and radical cystectomy with orthotopic neobladder 08/2023. Path showed complete response (ypT0N0).\n\nAdapting to neobladder function. Some stress incontinence, improving with pelvic floor PT.\n\nMeds: Oxybutynin ER 10mg, Vitamin B12, Probiotics.\n\nLabs (01/25/2024): Creatinine 1.0, B12 normal (on supplementation), electrolytes normal.\n\nECOG PS: 1\n\nNo hepatitis. PMH: Anxiety, IBS. 20 pack-year smoking history (quit 2 years ago).\n\nSignatera (02/01/2024): Negative\n\nExcellent pathologic response. Surveillance ongoing. Working with urology on continence optimization."
  },
  {
    "patient_id": "B017",
    "full_text": "81-year-old Caucasian male with NMIBC (HG Ta) managed conservatively due to advanced age and comorbidities. Multiple TURBTs over past 5 years.\n\nRecent TURBT 02/2024 showed stable HG Ta, no progression to T1 or CIS.\n\nDeclined BCG due to prior intolerance. Managed with surveillance and repeat TURBTs.\n\nMeds: Multiple for cardiac and pulmonary conditions.\n\nLabs (02/25/2024): Creatinine 1.5, GFR 42, Hgb 10.8.\n\nECOG PS: 2\n\nNo hepatitis. PMH: CAD, CHF, COPD, atrial fibrillation, CKD stage 3b.\n\nAcknowledged risk of progression but patient prefers bladder preservation with close surveillance. Family in agreement."
  },
  {
    "patient_id": "B018",
    "full_text": "49-year-old Hispanic female with occupational bladder cancer (aromatic amine exposure in dye industry). Stage I (pT1N0M0) high-grade urothelial carcinoma.\n\nUnderwent TURBT with re-TURBT showing no residual disease. Completed BCG induction.\n\nMeds: None cancer-related.\n\nLabs (02/10/2024): All within normal limits.\n\nECOG PS: 0\n\nNo hepatitis. PMH: Migraine headaches. Never smoker. Occupational exposure history documented.\n\nStarting BCG maintenance. Workers compensation claim filed. Close surveillance with cystoscopy q3 months for first 2 years."
  },
  {
    "patient_id": "B019",
    "full_text": "66-year-old African American male with muscle-invasive bladder cancer with plasmacytoid variant features. Known aggressive histology. Stage IIIA (pT3aN0M0) at cystectomy.\n\nReceived perioperative chemotherapy (neoadjuvant + adjuvant). Completed 09/2023.\n\nDeveloped peritoneal carcinomatosis at 4-month follow-up. Started palliative chemotherapy.\n\nMeds: FOLFOX (different regimen due to prior platinum exposure), supportive care.\n\nLabs (02/20/2024): CEA 15, Hgb 10.2, Creatinine 1.4.\n\nECOG PS: 1\n\nNo hepatitis. PMH: HTN, hyperlipidemia. 35 pack-year smoking history.\n\nDiscussing goals of care given aggressive disease biology and early recurrence."
  },
  {
    "patient_id": "B020",
    "full_text": "72-year-old Asian female with incidentally discovered bladder mass during workup for unrelated issue. TURBT showed low-grade Ta papillary urothelial carcinoma.\n\nLow-risk NMIBC. Single intravesical chemotherapy (MMC) given post-operatively.\n\nMeds: None cancer-related.\n\nLabs: All normal.\n\nECOG PS: 0\n\nNo hepatitis. PMH: Hypothyroidism, osteoporosis. Never smoker.\n\nSurveillance cystoscopy at 3 months showed no recurrence. Continuing yearly surveillance per guidelines for low-grade Ta."
  }
]
